class Settings():
    def __init__(self):
        self.collect_time = 5
        self.reload_time = 60
        self.data_user = 'root'
        self.data_passwd = '123456'
        self.data_base = 'bmcdb'
        self.data_host = '127.0.0.1'
        self.host_info = []
        self.tag = "0"
        self.linux_oids = [
                # "1.3.6.1.4.1.2021.4.5",  # 总内存
                "1.3.6.1.4.1.2021.4.6.0",  # 内存kongxian
                "1.3.6.1.4.1.2021.11.11.0",  # free cpu percent
                # ".1.3.6.1.2.1.25.3.3.1.2",
                "1.3.6.1.2.1.1.3.0",  # time
                "1.3.6.1.2.1.1.1",  # 系统基本信息
                ]
        self.windows_oids = [

                # "1.3.6.1.2.1.1.5",   #主机名
        ]
        self.hw_info = [
                "1.3.6.1.2.1.1.5",   #主机名
                # "1.3.6.1.2.1.25.4.2.1.2",  #系统运行进程列表
                "1.3.6.1.2.1.2.2.1.2",  #网络接口信息
                "1.3.6.1.2.1.2.1",   #网络接口数
                "1.3.6.1.2.1.25.2.2",  # 总内存
        ]
        self.storage = [
                "1.3.6.1.2.1.25.2.3.1.4",  # 簇的大小
                "1.3.6.1.2.1.25.2.3.1.5",  # 簇的个数
        ]
        self.route = [
                "1.3.6.1.4.1.2011.6.3.4.1.2"  #5sec
                "1.3.6.1.4.1.2011.6.3.4.1.3"   #1min
                "1.3.6.1.4.1.2011.6.3.4.1.4"   #5min
                "1.3.6.1.4.1.2011.6.3.5.1.1.2"  #内存Byte
                "1.3.6.1.4.1.2011.6.3.5.1.1.3"   #空闲Byte
        ]